app/controllers/welcome_controller.rb

  def index
    @articles = Article.limit(6)
---
SELECT  "articles".* FROM "articles" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 6]]