app/controllers/welcome_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ?  [["LIMIT", 10]]
---
  def index
    @articles = Article.limit(10)